
Функция hex(Знач Значение) 
	
    Значение=Число(Значение);
	
	Если Значение <= 0 Тогда 
		
        Результат = "0";
		
	Иначе
		
        Значение = Цел(Значение);
        Результат = "";
        Пока Значение > 0 Цикл
            Результат = Сред("0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ",Значение%16 + 1,1)+Результат;
            Значение = Цел(Значение/16) ;
		КонецЦикла;
		
	КонецЕсли;
	
    Если СтрДлина(Результат) < 2 Тогда
    
        Результат = "0" + Результат;
    
	КонецЕсли; 
	
    Возврат "%" + Результат;
	
КонецФункции

Функция ПреобразоватьСимволы(URL)
    
    Результат = "";
    
    Для Сч = 1 По СтрДлина(URL) Цикл
        
        ch = Сред(URL,Сч,1);
        vch = КодСимвола(ch);
        
        Если ("A" <= ch ) И ( ch <= "Z") Тогда        // "A".."Z"
 
            Результат = Результат + ch;
			
        ИначеЕсли ("a" <= ch ) И ( ch <= "z") Тогда    // "a".."z"
 
            Результат = Результат + ch;
			
        ИначеЕсли ("0" <= ch ) И ( ch <= "9") Тогда    // "0".."9"
 
            Результат = Результат + ch;
			
        ИначеЕсли (ch = " ") ИЛИ ( ch = "+") Тогда            // space
 
            Результат = Результат + "+";
			
        ИначеЕсли (ch = "-" ) ИЛИ ( ch = "_") Тогда        // unreserved
 
            // ch == '.' || ch == '!'
 
            // ch == '~' || ch == '*'
 
            // ch == '\'' || ch == '('
 
            // ch == ')') Тогда
 
            Результат = Результат + ch;
			
        ИначеЕсли (vch <= 127) Тогда        // other ASCII
 
            Результат = Результат + hex(vch);
			
        ИначеЕсли (vch <= 2047) Тогда        // non-ASCII <= 0x7FF
 
            Результат = Результат + hex(192 + Цел(vch / 64));
            Результат = Результат + hex(128 + (vch % 64));
			
        Иначе                    // 0x7FF < ch <= 0xFFFF
 
            Результат = Результат + hex(224 + Цел(vch / 4096));
            Результат = Результат + hex(128 + (Цел(vch / 64) % 64));
            Результат = Результат + hex(128 + (vch % 64));
			
        КонецЕсли;
         
    КонецЦикла; 
    
    Возврат Результат;

КонецФункции // ()
 
Процедура ПоказатьТочкиНаКарте() Экспорт
	
	ЗаписьРегистра = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Прочитать();
	АдресСсылки = ЗаписьРегистра.АдресКартыДляОтображенияТочек;
	Если НЕ ЗначениеЗаполнено(АдресСсылки) Тогда
		Сообщить("Не заполнен адрес карты для отображения точек! Отображение точек прервано!");
		Возврат;
	КонецЕсли;
	
	Ном = 0;
	
	Для Каждого Стр из СписокСамостоятельныхТочек Цикл
		
		Если ПустаяСтрока(Стр.Широта) И ПустаяСтрока(Стр.Долгота) Тогда
			Сообщить("Не заполнены координаты в строке " + Стр.НомерСтроки + "!", СтатусСообщения.Внимание);
			Продолжить;
		ИначеЕсли ПустаяСтрока(Стр.Широта) Или ПустаяСтрока(Стр.Долгота) Тогда
			Сообщить("Некорректно заполнены координаты в строке " + Стр.НомерСтроки + "!", СтатусСообщения.Внимание);
			Продолжить;
		КонецЕсли;
		
		НС = Строка(Ном);
		
		АдресСсылки = АдресСсылки + ?(Ном=0, "?latitude", "&latitude") + НС + "=" + СокрЛП(Стр.Широта) + 
					"&longitude" + НС + "=" + СокрЛП(Стр.Долгота) + 
					"&header" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Заголовок)) +
				 	"&text" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Текст)) + 
					"&time" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Время)) + 
					"&color" + НС + "=" + СокрЛП(Стр.Цвет);
		
		Ном = Ном + 1;
	КонецЦикла;
	
	ФормаСтраницыОтображенияКоординат = ЭтотОбъект.ПолучитьФорму("ФормаОтображениеСтраницы");
	ФормаСтраницыОтображенияКоординат.ЭлементыФормы.ПолеHTMLДокумента1.Перейти(АдресСсылки);
	ФормаСтраницыОтображенияКоординат.Открыть();
	
КонецПроцедуры

Процедура ПоказатьТочкиСТрекомНаКарте() Экспорт
	
	//ЗаписьРегистра = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	//ЗаписьРегистра.Прочитать();
	//АдресСсылки = ЗаписьРегистра.АдресКартыДляОтображенияТочек;
	//Если НЕ ЗначениеЗаполнено(АдресСсылки) Тогда
	//	Сообщить("Не заполнен адрес карты для отображения точек! Отображение точек прервано!");
	//	Возврат;
	//КонецЕсли;
	//
	//Ном = 0;
	//
	//Для Каждого Стр из СписокТочекЛиний Цикл
	//	
	//	Если ПустаяСтрока(Стр.Широта) И ПустаяСтрока(Стр.Долгота) Тогда
	//		Сообщить("Не заполнены координаты в строке " + Стр.НомерСтроки + "!", СтатусСообщения.Внимание);
	//		Продолжить;
	//	ИначеЕсли ПустаяСтрока(Стр.Широта) Или ПустаяСтрока(Стр.Долгота) Тогда
	//		Сообщить("Некорректно заполнены координаты в строке " + Стр.НомерСтроки + "!", СтатусСообщения.Внимание);
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	НС = Строка(Ном);
	//	
	//	АдресСсылки = АдресСсылки + ?(Ном=0, "?latitude", "&latitude") + НС + "=" + СокрЛП(Стр.Широта) + 
	//				"&longitude" + НС + "=" + СокрЛП(Стр.Долгота) + 
	//				"&header" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Заголовок)) +
	//			 	"&text" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Текст)) + 
	//				"&time" + НС + "=" + ПреобразоватьСимволы(СокрЛП(Стр.Время)) + 
	//				"&color" + НС + "=" + СокрЛП(Стр.Цвет);
	//	
	//	Ном = Ном + 1;
	//КонецЦикла;
	
	ФормаСтраницыОтображенияКоординат = ЭтотОбъект.ПолучитьФорму("ФормаОтображениеСтраницы");
	//ФормаСтраницыОтображенияКоординат.ЭлементыФормы.ПолеHTMLДокумента1.Перейти(АдресСсылки);
	ФормаСтраницыОтображенияКоординат.ЭлементыФормы.ПолеHTMLДокумента1.Перейти("http://exchange.mobiforce.ru/adm/OpenLayers/examples/osm-ya.html");
	ФормаСтраницыОтображенияКоординат.Открыть();
	
КонецПроцедуры
