
&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("ЗарядБатареи", ЗарядБатареи);
	СтруктураНастроек.Вставить("ДатаПоследнейАктивности", ДатаПоследнейАктивности);
	СтруктураНастроек.Вставить("Координаты", Координаты);
	
	Закрыть(СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗарядБатареи = Параметры.ЗарядБатареи;
	ДатаПоследнейАктивности = Параметры.ДатаПоследнейАктивности;
	Координаты = Параметры.Координаты;
	
КонецПроцедуры
