
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОтборСотрудников.СписокВыбора.Добавить(0, "Все");
	Элементы.ОтборСотрудников.СписокВыбора.Добавить(1, "Пользователи 1С");
	Элементы.ОтборСотрудников.СписокВыбора.Добавить(2, "Пользователи МК");
	
	Объект.ОтборСотрудников = Параметры.ОтборСотрудников;
	
	Если НЕ Параметры.АдресОтбораСпискаСотрудников = "" Тогда
		мОтбор = ПолучитьИзВременногоХранилища(Параметры.АдресОтбораСпискаСотрудников);
		Для Каждого текОтбор Из мОтбор.Элементы Цикл
			мНовыйОтбор = СписокСотрудников.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(мНовыйОтбор, текОтбор);
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	мСтруктура = Новый Структура;
	мСтруктура.Вставить("АдресОтборов", ПолучитьАдресХранилища());
	мСтруктура.Вставить("ОтборСотрудников", Объект.ОтборСотрудников);
	
	Закрыть(мСтруктура);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилища()
	
	Возврат ПоместитьВоВременноеХранилище(СписокСотрудников.Отбор, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура СписокСотрудниковОтборПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	
	Если НЕ Элемент.ТекущиеДанные = Неопределено Тогда
		Если Элемент.ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено
					ИЛИ Элемент.ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нельзя выбирать вид сравнения ""Заполнено"" или ""Не заполнено"".";
			Сообщение.Сообщить();
			Элемент.ТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			
			мТекущиеДанные = СписокСотрудников.Отбор.ПолучитьОбъектПоИдентификатору(Элемент.ТекущаяСтрока);
			мТекущиеДанные.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
									
			Отказ = Ложь;				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

