
&НаКлиенте
Процедура КомандаОК(Команда)
		
	Если Не ЗначениеЗаполнено(ПричинаОтклоненияРезультатовВыполнения) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите причину отклонения задачи!";
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ПричинаОтклоненияРезультатовВыполнения", ПричинаОтклоненияРезультатовВыполнения);
	СтруктураРезультата.Вставить("ОписаниеПричиныОтклоненияРезультатовВыполнения", ОписаниеПричиныОтклоненияРезультатовВыполнения);
	
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры
