
&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Не ЗначениеЗаполнено(ПричинаЗавершенияЗадачи) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите причину завершения задачи!";		
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	СтруктураРезультата = Новый Структура;
	СтруктураРезультата.Вставить("ПричинаЗавершенияЗадачи", ПричинаЗавершенияЗадачи);
	СтруктураРезультата.Вставить("ОписаниеВыполненныхРабот", ОписаниеВыполненныхРабот);
	
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры

