
Процедура ЗаполнитьДаннымиПоУмолчанию() Экспорт
	
	//заполняем интервалами по умолчанию...
	Выборка = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.Выбрать();
	Если Выборка.Следующий() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заполнение значениями по умолчанию недоступно для уже заполненного стравочника!";
		Сообщение.Сообщить();		
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();	
	НовыйЭлемент.Наименование 				= "Распределение заявки";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "ЗаявкаДата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "Дата";
	НовыйЭлемент.Комментарий			 	= "От приема заявки до ввода задачи";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();
	НовыйЭлемент.Наименование 				= "Передача заявки инженеру";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "Дата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "ПринялОтклонилДата";
	НовыйЭлемент.Комментарий			 	= "От ввода задачи до даты принятия инженером";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();
	НовыйЭлемент.Наименование 				= "Время ожидания инженера";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "ПринялОтклонилДата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "ВыехалДата";
	НовыйЭлемент.Комментарий			 	= "От даты принятия инженером до даты выезда инженера";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();
	НовыйЭлемент.Наименование 				= "Время в пути";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "ВыехалДата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "ПриехалДата";
	НовыйЭлемент.Комментарий			 	= "От даты выезда инженера до даты приезда инженера";
	НовыйЭлемент.Записать();
	
	НовыйЭлемент = Справочники.атл_ИнтервалыВремениПоЗадачамМобильнымСотрудникам.СоздатьЭлемент();
	НовыйЭлемент.Наименование 				= "Время выполнения задачи";
	НовыйЭлемент.ИмяРеквизитаДатаНачала 	= "ПриехалДата";
	НовыйЭлемент.ИмяРеквизитаДатаОкончания 	= "ЗавершилДата";
	НовыйЭлемент.Комментарий			 	= "От даты приезда инженера до даты завершения задачи";
	НовыйЭлемент.Записать();

	
КонецПроцедуры