
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЧастотаОбновленияСписка = Параметры.ЧастотаОбновленияСписка;
	НаправлениеСортировкиВозрастание = Параметры.НаправлениеСортировкиВозрастание;
	МаксимальноеКоличествоВыводимыхСообщений = Параметры.МаксимальноеКоличествоВыводимыхСообщений;
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	мНастройка = Новый Структура;
	мНастройка.Вставить("ЧастотаОбновленияСписка", ЧастотаОбновленияСписка); 
	мНастройка.Вставить("НаправлениеСортировкиВозрастание", НаправлениеСортировкиВозрастание);
	мНастройка.Вставить("МаксимальноеКоличествоВыводимыхСообщений", МаксимальноеКоличествоВыводимыхСообщений);
	
	Закрыть(мНастройка);
	
КонецПроцедуры
