
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.АдресТаблицыВремениРаботы = "" Тогда
		ТаблицаВремениРаботы.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыВремениРаботы));	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Закрыть(ПолучитьАдресХранилища());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилища()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаВремениРаботы.Выгрузить(), УникальныйИдентификатор);	
	
КонецФункции




