#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция возвращает параметры проведения.
Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Номер,
	|	Реквизиты.Дата,
	|	Реквизиты.Ответственный,
	|	Реквизиты.Организация,
	|	Реквизиты.ВариантНачисления,
	|	Реквизиты.ВидПерерасчета,
	|	Реквизиты.ВидПлощади,
	|	Реквизиты.ВидОперации,
	|	Реквизиты.ДатаКон,
	|	Реквизиты.ДатаНач,
	|	Реквизиты.ДнейПерерасчета,
	|	Реквизиты.РазмерИзмененияТарифа,
	|	Реквизиты.УдалитьКорректировкаНормативныхНачисленийПоПУ,
	|	Реквизиты.Объект,
	|	Реквизиты.ОснованиеПерерасчета,
	|	Реквизиты.ПроцентПерерасчета,
	|	Реквизиты.ПроцентИзмененияНачисления,
	|	Реквизиты.ПроцентСнижения,
	|	Реквизиты.РегистрироватьКакОплату,
	|	Реквизиты.СуммаДокумента,
	|	Реквизиты.Услуга,
	|	Реквизиты.ВариантКорректировкиУслуг,
	|	Реквизиты.ФлагПониженияТарифа,
	|	Реквизиты.ЧасовПерерасчета,
	|	Реквизиты.ЧастичныйПерерасчет
	|ИЗ
	|	Документ.КВП_КорректировкаНачислений КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Реквизиты = Новый Структура("Ссылка,Номер,Дата,Ответственный,Организация,ВариантНачисления,
								|ВидПерерасчета,ВидПлощади,ВидОперации,ДатаКон,
								|ДатаНач,ДнейПерерасчета,РазмерИзмененияТарифа,
								|УдалитьКорректировкаНормативныхНачисленийПоПУ,Объект,ОснованиеПерерасчета,
								|ПроцентПерерасчета,ПроцентИзмененияНачисления,ПроцентСнижения,РегистрироватьКакОплату,
								|СуммаДокумента,Услуга,ВариантКорректировкиУслуг,ФлагПониженияТарифа,
								|ЧасовПерерасчета,ЧастичныйПерерасчет");
	
	// Дополним структуру реквизитов настройкой варианта изменения задолженности в корректировках начислений.
	Реквизиты.Вставить("ВариантИзмененияЗадолженностиВКорректировкахНачислений", Константы.УПЖКХ_ВариантИзмененияЗадолженностиВКорректировкахНачислений.Получить());
	
	ЗаполнитьЗначенияСвойств(Реквизиты, Выборка);
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);
	
	Возврат ПараметрыПроведения;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли