
&НаКлиенте
Процедура Местонахождение(Команда)
		
	АдресТаблицы = ПолучитьАдресТаблицы();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСпискаПараметровОткрытия", АдресТаблицы);
	ПараметрыФормы.Вставить("НеИнтерактивноеОткрытие", Истина);
	ПараметрыФормы.Вставить("ВводКоординаты", Истина);
	ПараметрыФормы.Вставить("ЗаголовокФормы", "Адрес контрагента");
	
	ОповещениеФормы = Новый ОписаниеОповещения("ОбработкаВводаКоординат", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.атл_ОтображениеТочекСТрекомНаКарте.Форма.Форма", ПараметрыФормы, ЭтаФорма,,,, ОповещениеФормы);

КонецПроцедуры

&НаСервере
Функция ПолучитьАдресТаблицы()
	
	ТаблицаПараметровОткрытия = атл_УправлениеМобильнымиСотрудникамиСервер.СформироватьТаблицуСписокПараметровОткрытияДляОткрытияКарты();
	
	мНоваяСтрока = ТаблицаПараметровОткрытия.Добавить();
	мНоваяСтрока.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	мНоваяСтрока.Объект = Объект.Ссылка;
	мНоваяСтрока.Примечание = Объект.Адрес;
	Если ЗначениеЗаполнено(Объект.АдресШирота) И ЗначениеЗаполнено(Объект.АдресДолгота) Тогда
		мНоваяСтрока.ВидОбъекта = "ТочкаНаКарте";		
		мНоваяСтрока.Широта = Объект.АдресШирота;
		мНоваяСтрока.Долгота = Объект.АдресДолгота;
	Иначе
		мНоваяСтрока.ВидОбъекта = "АдресДляПоискаНаКарте";			
	КонецЕсли;		
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПараметровОткрытия, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВводаКоординат(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатЗакрытия = Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("Строка") И НЕ РезультатЗакрытия = "" тогда
		НайденныйРазделитель = Найти(РезультатЗакрытия, ";");
		Если НайденныйРазделитель > 0 Тогда
			Модифицированность = Истина;
			Объект.АдресДолгота = Сред(РезультатЗакрытия, 1, НайденныйРазделитель - 1);
			Объект.АдресШирота = Сред(РезультатЗакрытия, НайденныйРазделитель + 1);			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеКонтактноеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы = Новый ОписаниеОповещения("ЗаписьОбъектаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеФормы, "Перед выбором основного контактного лица необходимо записать контрагента. Записать?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновноеКонтактноеЛицоСоздание(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы = Новый ОписаниеОповещения("ЗаписьОбъектаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеФормы, "Перед выбором основного контактного лица необходимо записать контрагента. Записать?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписьОбъектаПослеВопроса(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Записать();	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОсновноеПодразделениеКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы = Новый ОписаниеОповещения("ЗаписьОбъектаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеФормы, "Перед выбором основного подразделения необходимо записать контрагента. Записать?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ОсновноеПодразделениеКонтрагентаСоздание(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СтандартнаяОбработка = Ложь;
		ОписаниеФормы = Новый ОписаниеОповещения("ЗаписьОбъектаПослеВопроса", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеФормы, "Перед выбором основного подразделения необходимо записать контрагента. Записать?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;	
	
КонецПроцедуры

