
&НаКлиенте
Процедура КнопкаВыбораПериода(Команда)
	
	ПеременнаяТипаСтандартныйПериод = Новый СтандартныйПериод; 

	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период.ДатаНачала = Объект.ДатаНачала; 
	Диалог.Период.ДатаОкончания = Объект.ДатаОкончания; 
	Если Диалог.Редактировать() Тогда 
		ПеременнаяТипаСтандартныйПериод = Диалог.Период;
		Объект.ДатаНачала = ПеременнаяТипаСтандартныйПериод.ДатаНачала;
		Объект.ДатаОкончания = ПеременнаяТипаСтандартныйПериод.ДатаОкончания;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура КомандаВыполнитьНаСервере()
	
	МассивИнтервалов = атл_УправлениеМобильнымиСотрудниками.ПолучитьМассивИнтервалов();

	Если ЗначениеЗаполнено(Объект.ЗадачаМобильномуСотруднику) Тогда
		
		Для Каждого Интервал из МассивИнтервалов Цикл
			атл_УправлениеМобильнымиСотрудниками.СформироватьЗаписьВРегистреатл_ЗатраченноеВремяПоИнтерваламПоЗадачамМобильнымСотрудникам(Объект.ЗадачаМобильномуСотруднику, Интервал);
		КонецЦикла;
		
	Иначе
		
		ВыборкаЗадач = Документы.атл_ЗадачаМобильномуСотруднику.Выбрать(Объект.ДатаНачала, ?(Объект.ДатаОкончания = Дата("00010101"), Дата("39991231"), КонецДня(Объект.ДатаОкончания)));
		
		Пока ВыборкаЗадач.Следующий() Цикл
			Для Каждого Интервал из МассивИнтервалов Цикл
				атл_УправлениеМобильнымиСотрудниками.СформироватьЗаписьВРегистреатл_ЗатраченноеВремяПоИнтерваламПоЗадачамМобильнымСотрудникам(ВыборкаЗадач.Ссылка, Интервал);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	КомандаВыполнитьНаСервере();
	
КонецПроцедуры

