
Функция Картаmap(Запрос)
		
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-Type","text/html; charset=utf-8");
	
	Широта = Запрос.ПараметрыЗапроса.Получить("latitude"); 
	Долгота = Запрос.ПараметрыЗапроса.Получить("longitude"); 
	Логин = Запрос.ПараметрыЗапроса.Получить("login"); 
	Пароль = Запрос.ПараметрыЗапроса.Получить("pass"); 
	Браузер = Запрос.ПараметрыЗапроса.Получить("browser"); 
	HTTP_Клиент = Запрос.ПараметрыЗапроса.Получить("httpclient"); 
	
	стрАдресКарты = "?login=" + Строка(Логин) 
					+ "&pass=" + Строка(Пароль);
	
	Если ЗначениеЗаполнено(Широта) И ЗначениеЗаполнено(Долгота) Тогда
		стрАдресКарты = стрАдресКарты +"&longitude=" + Строка(Долгота) + "&latitude=" + Строка(Широта);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Браузер) Тогда
		стрАдресКарты = стрАдресКарты +"&browser=" + Строка(Браузер);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(HTTP_Клиент) Тогда
		стрАдресКарты = стрАдресКарты +"&httpclient=" + Строка(HTTP_Клиент);
	КонецЕсли;
	
	имяВыходногоФайла = ПолучитьимяВременногоФайла("xml");
		
	ЗаписьРегистра = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	ЗаписьРегистра.Прочитать();	
	Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.АдресКартыДляОтображенияТочек) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнен адрес карты для отображения!";				
		Сообщение.Сообщить();
		Возврат Неопределено;
	Иначе
		стрОсновнойАдресКарта = ЗаписьРегистра.АдресКартыДляОтображенияТочек;
		стрОсновнойАдресКарта = СтрЗаменить(стрОсновнойАдресКарта, "http://", "");
		Соединение = Новый HTTPСоединение(стрОсновнойАдресКарта);	
	КонецЕсли;	
	
	Соединение.Получить(стрАдресКарты, имяВыходногоФайла);
	
	Файл = Новый ЧтениеТекста(имяВыходногоФайла);
	ВесьФайлОднойСтрокой = Файл.Прочитать();
	Файл.Закрыть();
	
	Ответ.УстановитьТелоИзСтроки(ВесьФайлОднойСтрокой);
	
	Возврат Ответ;
	
КонецФункции
