

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Файлы = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицы);
	ТабДокумент = ВывестиМакетФайловДополнительногоРеквизита(Файлы, Параметры.ДополнительныйРеквизит);
	
КонецПроцедуры

&НаСервере
Функция ВывестиМакетФайловДополнительногоРеквизита(Файлы, ДополнительныйРеквизит) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.атл_ЗадачаМобильномуСотруднику.ПолучитьМакет("КартинкиДополнительныхРеквизитов");
	//ИмяКаталога = КаталогВременныхФайлов();
	
	СписокФайлов = Файлы.НайтиСтроки(Новый Структура("ДополнительныйРеквизит", ДополнительныйРеквизит));	
		
	СчКартинок = 1;
	Для Каждого текФайл Из СписокФайлов Цикл
		ЗаписьФайла = РегистрыСведений.атл_ФайлыУМС.СоздатьМенеджерЗаписи();
		ЗаписьФайла.ИдентификаторИнформационнойБазы = текФайл.ИдентификаторИнформационнойБазыФайла;
		ЗаписьФайла.ИдентификаторФайла 				= текФайл.ИдентификаторФайла;
		ЗаписьФайла.Прочитать();
				
		Область = Макет.ПолучитьОбласть("ОбластьКартинки|Область" + Строка(СчКартинок));				
		//ИмяВременногоФайла = ПолучитьИмяФайла(ИмяКаталога, ЗаписьФайла.ИмяФайла);
		
		Попытка
			//ВложенныйФайл = ЗаписьФайла.ДанныеФайла.Получить();
			//ВложенныйФайл.Записать(ИмяВременногоФайла);
			
			ИмяКартинки = "КартинкаФайла" + Строка(СчКартинок);
			//Область.Рисунки[ИмяКартинки].Картинка = Новый Картинка(ИмяВременногоФайла);
			
			ДвоичныеДанные = ЗаписьФайла.ДанныеФайла.Получить();//ПолучитьДвоичныеДанныеФайла(ЗаписьФайла.ДанныеФайла);
						
			Область.Рисунки[ИмяКартинки].Картинка = Новый Картинка(ДвоичныеДанные);;
			
			Если ЗначениеЗаполнено(текФайл.Подпись) Тогда
				Область.Параметры["Комментарий" + Строка(СчКартинок)] = СокрЛП(текФайл.Подпись);			
			Иначе
				Область.Параметры["Комментарий" + Строка(СчКартинок)] = "Подпись к фотографии отсутствует";			
			КонецЕсли;
			
			Если НЕ ЗаписьФайла.ДатаРегистрации = Дата("00010101") Тогда
				Область.Параметры["ВремяСъемки" + Строка(СчКартинок)] = Формат(ЗаписьФайла.ДатаРегистрации, "ДЛФ=ДВ");
			КонецЕсли;
			
			СтруктураРасшировкиКарты = Новый Структура;
			СтруктураРасшировкиКарты.Вставить("Дата", ЗаписьФайла.ДатаРегистрации);
			СтруктураРасшировкиКарты.Вставить("Отправитель", ЗаписьФайла.Отправитель);
			Область.Параметры.РасшифровкаПараметрыСъемки = СтруктураРасшировкиКарты;
			
			СтруктураРасшировки = Новый Структура();
			СтруктураРасшировки.Вставить("ИдентификаторИнформационнойБазы", текФайл.ИдентификаторИнформационнойБазыФайла);
			СтруктураРасшировки.Вставить("ИдентификаторФайла", текФайл.ИдентификаторФайла);
			Область.Рисунки[ИмяКартинки].Расшифровка = СтруктураРасшировки;			
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать файл на диск! Скорее всего файл еще не полностью загружен в базу.";						
			Сообщение.Сообщить();
		КонецПопытки;
		
		Если СчКартинок = 1 Тогда			
			ТабДок.Вывести(Область);			
			СчКартинок = СчКартинок +1;
		Иначе
			ТабДок.Присоединить(Область);
			СчКартинок = 1;
		КонецЕсли;		

	КонецЦикла;
	
	ТабДок.ТолькоПросмотр = Истина;
	
	Возврат ТабДок;
	
КонецФункции

&НаКлиенте
Процедура ТабДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Попытка 
		Расшифровка = Элемент.ТекущаяОбласть.Расшифровка;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		Если Расшифровка.Свойство("ИдентификаторИнформационнойБазы") Тогда
			ИмяФайла = "";
			АдресФайла = "";
			
			ПолучитьИмяФайлаИАдрес(Расшифровка.ИдентификаторИнформационнойБазы, Расшифровка.ИдентификаторФайла, ИмяФайла, АдресФайла);			
			
			#Если ВебКлиент Тогда
				
				Если Не ПодключитьРасширениеРаботыСФайлами() Тогда 
		            ПодключитьРасширениеРаботыСФайлами();								
				КонецЕсли;
				ПолучитьФайл(АдресФайла, ИмяФайла, Истина);
			
			#Иначе
				
				РабочийКаталогПользователя = КаталогВременныхФайлов();
				ПолноеИмяФайлаНаКлиенте = РабочийКаталогПользователя + ИмяФайла;		
						
				Попытка
					ФайлНаДиске = Новый Файл(ПолноеИмяФайлаНаКлиенте);				
					Если ФайлНаДиске.Существует() Тогда
						ЗапуститьПриложение(ПолноеИмяФайлаНаКлиенте);
					Иначе
						ПолучитьФайл(АдресФайла, ПолноеИмяФайлаНаКлиенте, Ложь);
						ЗапуститьПриложение(ПолноеИмяФайлаНаКлиенте);
					КонецЕсли;
				Исключение
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Не удалось для открытия записать файл на диск!";
					Сообщение.Сообщить();				
				КонецПопытки;
				
			#КонецЕсли

		ИначеЕсли Расшифровка.Свойство("Дата") Тогда 
			//Сообщить("Дата "+ Расшифровка.Дата + ", " + Расшифровка.Отправитель); 
		КонецЕсли;						
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИмяФайлаИАдрес(ИдентификаторИнформационнойБазы, ИдентификаторФайла, ИмяФайла, АдресФайла)
	
	ЗаписьФайла = РегистрыСведений.атл_ФайлыУМС.СоздатьМенеджерЗаписи();
	ЗаписьФайла.ИдентификаторИнформационнойБазы = ИдентификаторИнформационнойБазы;
	ЗаписьФайла.ИдентификаторФайла = ИдентификаторФайла;
	ЗаписьФайла.Прочитать();
	
	ИмяФайла = ЗаписьФайла.ИмяФайла;
	ДвоичныеДанные = ЗаписьФайла.ДанныеФайла.Получить();
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецПроцедуры

