
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодчиститьКукиВРегистре();
	
	мЗаписьРегистраатл_НастройкиПодсистемыУМС = РегистрыСведений.атл_НастройкиПодсистемыУМС.СоздатьМенеджерЗаписи();
	мЗаписьРегистраатл_НастройкиПодсистемыУМС.Прочитать(); 
	
	ПериодичностьСинхронизацииССервером = мЗаписьРегистраатл_НастройкиПодсистемыУМС.ПериодичностьСинхронизацииССервером;	
	
	Если мЗаписьРегистраатл_НастройкиПодсистемыУМС.ИспользоватьФоновыйРежимОбмена Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Используется обмен с помощью регламентного задания на сервере. Запуск обработки не требуется!
		|Если база запущена в файловом режиме или запуск регламентного задания на сервере не используется, 
		|то перед запуском обработки в настройках подсистемы УМС снимите флаг 'Использовать фоновый режим обмена'.
		|Вызвать настройки можно из обработки 'Обмен данными УМС'.";
		Сообщение.Сообщить();		
		Отказ = Истина;
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
			
	Если ПериодичностьСинхронизацииССервером < 15 Тогда
		ПодключитьОбработчикОжидания("ЗапуститьРегламентноеЗадание", 15);
	Иначе
		ПодключитьОбработчикОжидания("ЗапуститьРегламентноеЗадание", ПериодичностьСинхронизацииССервером);
	КонецЕсли;
	
	ЗапуститьРегламентноеЗадание();	

КонецПроцедуры

&НаСервере
Процедура ПодчиститьКукиВРегистре() Экспорт
	
	ЗаписьРегистраСинхронизацииССервером = РегистрыСведений.атл_ПеременныеСинхронизацииССерверомУМС.СоздатьМенеджерЗаписи();
	ЗаписьРегистраСинхронизацииССервером.Прочитать();
	ЗаписьРегистраСинхронизацииССервером.КукиФоновогоОбмена = "";
	ЗаписьРегистраСинхронизацииССервером.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ОтключитьОбработчикОжидания("ЗапуститьРегламентноеЗадание");
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Вы закрыли обработку обмена! Обмен с сервером остановлен!";
	Сообщение.Сообщить();	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРегламентноеЗадание()
	
	мНадписьТекущееСостояниеОбмена = "";
	ВыполнитьОбменУМСПоРасписаниюИзФормы(мНадписьТекущееСостояниеОбмена);
	Элементы.НадписьТекущееСостояниеОбмена.Заголовок = мНадписьТекущееСостояниеОбмена;
	
	Если Не Объект.ОтключитьИнформированиеОСтатусеОбмена Тогда
		мСтр = СокрЛП(СтрЗаменить(мНадписьТекущееСостояниеОбмена, "Выполнен обмен", ""));
		#Если ВебКлиент Тогда
			мСтр = Сред(мСтр,14,19) + " - " + Сред(мСтр,56,8); 	
			ПоказатьОповещениеПользователя("Выполнен обмен",,мСтр);
		#Иначе
			ПоказатьОповещениеПользователя("Выполнен обмен",,мСтр);
		#КонецЕсли
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОбменУМСПоРасписаниюИзФормы(мНадписьТекущееСостояниеОбмена)
		
	атл_УправлениеМобильнымиСотрудниками.ВыполнитьОбменУМСПоРасписаниюИзФормы(мНадписьТекущееСостояниеОбмена);//ЭлементыФормы.НадписьТекущееСостояниеОбмена);
	
КонецПроцедуры

