
&НаСервере
Процедура ОКНаСервере()
	
	мИдентификаторКомментария = атл_УправлениеМобильнымиСотрудниками.ПолучитьИдентификаторНовогоКомментария();
	мДатаСоздания = ТекущаяДата();
	мДатаРегистрации = мДатаСоздания;
	
	МенеджерЗаписи = РегистрыСведений.атл_КомментарииКОбъектамУМС.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Объект 					= Запись.Объект;
	МенеджерЗаписи.ДатаСоздания 			= мДатаСоздания;
	МенеджерЗаписи.ДатаРегистрации 			= мДатаРегистрации;
	МенеджерЗаписи.Автор 					= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.ИдентификаторКомментария = мИдентификаторКомментария;
	МенеджерЗаписи.Текст					= Текст;
	
	МенеджерЗаписи.Записать();
	
	Если Запись.Объект.ИдентификаторыПакетовНаСервере.Количество() > 0 Тогда
		атл_УправлениеМобильнымиСотрудниками.ОтправитьКомментарий(Запись.Объект, мИдентификаторКомментария);		
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ОКНаСервере();
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запись.Объект = Параметры.Объект;
	
КонецПроцедуры
