
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	#Если ВебКлиент Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "В режиме Веб-клиента вывод списка имени файлов пакетов не доступен!";
		Сообщение.Сообщить();
		
	#Иначе
		
		Если Поле.Имя = "ИменаФайловПакетов" Тогда
			СтандартнаяОбработка = Ложь;
			//пытаемся извлечь текст
			//разбираем имена файлов...
			СтрокаИмен = Элемент.ТекущиеДанные.ИменаФайловПакетов;
			ОбщаяДлина = СтрДлина(СтрокаИмен);
			МассивИменФайлов = Новый Массив;
			ТекущееИмя = "";
			Для Сч=1 по ОбщаяДлина Цикл
				ТекущийСимвол = Сред(СтрокаИмен,Сч,1);
				Если ТекущийСимвол = ":" Тогда
					МассивИменФайлов.Добавить(ТекущееИмя);
					ТекущееИмя = "";
				Иначе
					ТекущееИмя = ТекущееИмя + ТекущийСимвол;
				КонецЕсли;
			КонецЦикла;
			Если ТекущееИмя <> "" Тогда
				МассивИменФайлов.Добавить(ТекущееИмя);
			КонецЕсли;
			
			//формируем текст для вывода
			Таб =  Новый ТабличныйДокумент;
			СформироватьМакет(Таб, МассивИменФайлов); 
			Таб.Показать("Содержимое файлов");
			
		КонецЕсли;
		
	#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура СформироватьМакет(Таб, МассивИменФайлов)
	
	РегистрыСведений.атл_СтатистикаОбменовДаннымиССерверомУМС.Печать(Таб, МассивИменФайлов); 	
	
КонецПроцедуры

