
&НаКлиенте
Процедура ОткрытьФайлДанных(Команда)
	
	ИмяФайла = Запись.ИмяФайла;
	АдресФайла = "";
		
	АдресФайла = ПолучитьАдресФайла();	
		
	РабочийКаталогПользователя = КаталогВременныхФайлов();
	ПолноеИмяФайлаНаКлиенте = РабочийКаталогПользователя + ИмяФайла;
	
	Попытка
		ФайлНаДиске = Новый Файл(ПолноеИмяФайлаНаКлиенте);
		Если ФайлНаДиске.Существует() Тогда
			ЗапуститьПриложение(ПолноеИмяФайлаНаКлиенте);
		КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось для открытия записать файл на диск!";
		Сообщение.Сообщить();		
	КонецПопытки;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресФайла()
	
	ЗаписьФайла = РегистрыСведений.атл_ФайлыУМС.СоздатьМенеджерЗаписи();
	ЗаписьФайла.ИдентификаторИнформационнойБазы = Запись.ИдентификаторИнформационнойБазы;
	ЗаписьФайла.ИдентификаторФайла = Запись.ИдентификаторФайла;
	ЗаписьФайла.Прочитать();
		
	ДвоичныеДанные = ЗаписьФайла.ДанныеФайла.Получить();
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
	Возврат АдресФайла;
		
КонецФункции
