
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		Элементы.ТекстУсловия.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ОписаниеПараметров = Справочники.атл_ШаблоныЗаполненияДополнительныхРеквизитов.ПолучитьМакет("ОписаниеПараметров");	
	ПодсказкаПолеHTMLДокумента = ОписаниеПараметров.ПолучитьТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ПроверитьКорректностьШаблона() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Шаблон формулы не может быть пустым";
		Сообщение.Поле = "Объект.ТекстУсловия";		
		Сообщение.Сообщить();
		
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьКорректностьШаблона()
	Возврат ?(ЗначениеЗаполнено(СокрЛП(Объект.ТекстУсловия)), Истина, Ложь); 
КонецФункции



