
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьУсловноеОформление();
	НачальноеЗначение = Параметры.НачальноеЗначение;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)	
		
	Если Настройки.Получить("СписокЦветов") = Неопределено ИЛИ
			(Настройки.Получить("СписокЦветов") <> Неопределено И Настройки.Получить("СписокЦветов").Количество() = 0) Тогда		
		ЗаполнитьСписокЦветовПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(НачальноеЗначение) Тогда
		мНайденные = СписокЦветов.НайтиСтроки(Новый Структура("Цвет", НачальноеЗначение));			
		Если мНайденные.Количество() > 0 Тогда
			Элементы.СписокЦветов.ТекущаяСтрока = мНайденные[0].ПолучитьИдентификатор();
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЦветовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	мТекущиеДанные = Элементы.СписокЦветов.ТекущиеДанные;
	Если НЕ мТекущиеДанные = Неопределено Тогда
		Закрыть(мТекущиеДанные.Цвет);
	Иначе
		Закрыть("");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ОК(Команда)
	
	мТекущиеДанные = Элементы.СписокЦветов.ТекущиеДанные;
	Если НЕ мТекущиеДанные = Неопределено Тогда
		Закрыть(мТекущиеДанные.Цвет);
	Иначе
		Закрыть("");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУмолчанию(Команда)
	
	ЗаполнитьСписокЦветовПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЦветовПоУмолчанию()
	
	СписокЦветов.Очистить();
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Красный";
	мНоваяСтрока.Цвет = "#FF0000";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Синий";
	мНоваяСтрока.Цвет = "#0000FF";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Зеленый";
	мНоваяСтрока.Цвет = "#008000";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Желтый";
	мНоваяСтрока.Цвет = "#FFFF00";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Кирпичный";
	мНоваяСтрока.Цвет = "#B22222";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Бирюзовый";
	мНоваяСтрока.Цвет = "#40E0D0";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Коричневый";
	мНоваяСтрока.Цвет = "#8B4513";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Серый";
	мНоваяСтрока.Цвет = "#808080";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Индиго";
	мНоваяСтрока.Цвет = "#4B0082";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Темно-синий";
	мНоваяСтрока.Цвет = "#00008B";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Черный";
	мНоваяСтрока.Цвет = "#000000";
	
	мНоваяСтрока = СписокЦветов.Добавить();
	мНоваяСтрока.Наименование = "Васильковый";
	мНоваяСтрока.Цвет = "#6495ED";
	
	СписокЦветов.Сортировать("Наименование ВОЗР");
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедураИФункции

&НаСервере
Процедура ЗаполнитьУсловноеОформление()
		
	мЭлементыУФ = УсловноеОформление.Элементы;
	мЭлементыУФ.Очистить();
	
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#FF0000", Новый Цвет(255,0,0));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#0000FF", Новый Цвет(0,0,255));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#008000", Новый Цвет(0,128,0));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#FFFF00", Новый Цвет(255,255,0));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#B22222", Новый Цвет(178,34,34));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#40E0D0", Новый Цвет(64,224,208));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#8B4513", Новый Цвет(139,69,19));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#808080", Новый Цвет(128,128,128));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#4B0082", Новый Цвет(75,0,130));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#00008B", Новый Цвет(0,0,139));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#000000", Новый Цвет(0,0,0));
	ДобавитьЭлементУФ(мЭлементыУФ.Добавить(), "#6495ED", Новый Цвет(100,149,237));		
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементУФ(Элемент, Цвет, ЦветФона)
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("СписокЦветовЦвет");

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("СписокЦветов.Цвет");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Цвет;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
	
КонецПроцедуры

#КонецОбласти

