
//////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаСервере
// Процедура сохраняет настройки уточнения в хранилище.
//
Функция СохранитьНастройкиУточненияМатериалов()
	
	Возврат ПоместитьВоВременноеХранилище(УточнениеМатериалов.Выгрузить());
	
КонецФункции

#КонецОбласти

//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресНастроекУточненияМатериалов") Тогда
		
		НастройкиУточненияМатериалов = ПолучитьИзВременногоХранилища(Параметры.АдресНастроекУточненияМатериалов);
		
		Если ТипЗнч(НастройкиУточненияМатериалов) = Тип("ТаблицаЗначений") Тогда
			
			УточнениеМатериалов.Загрузить(НастройкиУточненияМатериалов);
			
			НастройкиУточненияМатериалов.Свернуть("ВидРабот, ВидМатериала");
			ВидыРаботВидыМатериалов.Загрузить(НастройкиУточненияМатериалов);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
// Обработчик события "НачалоВыбора" ссылочных полей.
//
Процедура СсылочноеПолеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
// Обработчик события "ПриАктивизацииСтроки" поля "Уточнение_ВидыРаботВидыМатериалов".
//
Процедура ВидыРаботВидыМатериаловПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ВидыРаботВидыМатериалов.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда
		Элементы.УточнениеМатериалов.ОтборСтрок = Новый ФиксированнаяСтруктура("ВидРабот, ВидМатериала", ТекущиеДанные.ВидРабот, ТекущиеДанные.ВидМатериала);
	Иначе
		Элементы.УточнениеМатериалов.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы

&НаКлиенте
// Обработчик команды "КомандаПрименитьУточнения".
//
Процедура КомандаПрименитьУточнения(Команда)
	
	Закрыть(СохранитьНастройкиУточненияМатериалов());
	
КонецПроцедуры

#КонецОбласти