
Перем ПараметрыЗавершенияПрограммы Экспорт; // Структура параметров, используемая в процессе завершения программы.

#Область ОбработчикиСобытий

Процедура ПриНачалеРаботыСистемы()	

	атл_УправлениеМобильнымиСотрудникамиКлиент.ОтключитьРегистрациюСобытийВЖурналеРегистрации();
	
	атл_УправлениеМобильнымиСотрудникамиКлиент.ПроверитьЗаполнениеПараметровСеанаса();
	
	атл_ВыполнитьОбновлениеИнформационнойБазы();
	
	мПериодичностьОбновленияОкнаСообщений = атл_УправлениеМобильнымиСотрудникамиКлиент.ПолучитьПериодичностьОбновленияОкнаСообщений();
	
	атл_Таймер();
	ПодключитьОбработчикОжидания("атл_Таймер", 30, Ложь);
	
	атл_ЗапуститьОбработкиПоНастройкамПользователя();
	
КонецПроцедуры

Процедура атл_Таймер() Экспорт
	
	атл_УправлениеМобильнымиСотрудникамиКлиент.ОбновитьАктивностьПользователяНаКлиенте();
	
	атл_УправлениеМобильнымиСотрудникамиКлиент.ДобавитьНовыеПолученныеСообщенияНаКлиенте();
			
КонецПроцедуры

Процедура атл_ЗапуститьОбработкиПоНастройкамПользователя()		
	
	атл_УправлениеМобильнымиСотрудникамиКлиент.ЗапуститьОбработкиПоНастройкамПользователяНаКлиенте();
	
КонецПроцедуры

Процедура атл_ВыполнитьОбновлениеИнформационнойБазы()
		
	атл_УправлениеМобильнымиСотрудникамиКлиент.ВыполнитьОбновлениеИнформационнойБазыНаКлиенте();
		
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	#Если НЕ ВебКлиент Тогда				
		Отказ = Ложь;
		
		Если ТипЗнч(ПараметрыЗавершенияПрограммы) <> Тип("Структура") Тогда
			ПараметрыЗавершенияПрограммы = Новый Структура;
		КонецЕсли;
			
		Если ПараметрыЗавершенияПрограммы.Свойство("ДействияПередЗавершениемРаботыСистемыВыполнены") Тогда
			ПараметрыЗавершенияПрограммы.Удалить("ДействияПередЗавершениемРаботыСистемыВыполнены");
		ИначеЕсли атл_УправлениеМобильнымиСотрудникамиСервер.ЗапрашиватьПодтверждениеПриЗакрытии() Тогда
			атл_УправлениеМобильнымиСотрудникамиКлиент.ЗадаватьВопросОЗакрытии();				
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры

#КонецОбласти