
#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	мИмяПользователя = атл_УправлениеМобильнымиСотрудникамиСервер.ПолучитьОсновногоПользователя();
	атл_УправлениеМобильнымиСотрудникамиСервер.ЗаполнитьПараметрыСеанса(мИмяПользователя);		
	
	Если ПараметрыСеанса.ТекущийПользователь.атл_ИспользоватьКомпактныйРежимОтображения Тогда 
		НоваяНастройка = Новый НастройкиКлиентскогоПриложения;
		НоваяНастройка.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",, НоваяНастройка);
	Иначе
		НоваяНастройка = Новый НастройкиКлиентскогоПриложения;
		НоваяНастройка.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Авто;
		ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",, НоваяНастройка);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти