
#Область СобытияФормыИЭЛементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОсобыйВидДополнительногоРеквизитаПриИзменении(Элемент)
	ОсобыйВидДополнительногоРеквизитаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаРеквизитовПриИзменении(Элемент)
	ГруппаРеквизитовПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти


#Область ПрочиеПроцедуры

&НаСервере
Процедура ДоступностьЭлементовФормы()
	
	Если Объект.ГруппаРеквизитов Тогда
		Элементы.СворачиватьГруппуРеквизитовПоУмолчанию.Доступность = Истина;
		Элементы.ТипЗначения.Доступность = Ложь;
		Элементы.Порядок.Доступность = Ложь;
		Элементы.ЗаполняетсяНаМК.Доступность = Ложь;
		Элементы.Обязателен.Доступность = Ложь;				
		Элементы.ОсобыйВидДополнительногоРеквизита.Доступность 				 = Ложь;		
				
	Иначе
		Элементы.СворачиватьГруппуРеквизитовПоУмолчанию.Доступность = Ложь;		
		Элементы.Порядок.Доступность = Истина;
		
		Если Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.Гиперссылка 
				ИЛИ Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.КоллекцияКартинок 
				ИЛИ Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.Координата Тогда
			Элементы.ЗаполняетсяНаМК.Доступность = Ложь;		
			Элементы.ТипЗначения.Доступность = Ложь;
		Иначе
			Элементы.ЗаполняетсяНаМК.Доступность = Истина;
			Элементы.ТипЗначения.Доступность = Истина;
		КонецЕсли;
	
		Элементы.Обязателен.Доступность = Истина;		
		Элементы.ОсобыйВидДополнительногоРеквизита.Доступность 				 = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОсобыйВидДополнительногоРеквизитаПриИзмененииНаСервере()
	
	Если Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.Гиперссылка Тогда
		Объект.ЗаполняетсяНаМК = Ложь;
		КС = Новый КвалификаторыСтроки(1000);		
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка", , КС);
	ИначеЕсли  Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.КоллекцияКартинок 
				ИЛИ Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.Координата Тогда
		Объект.ЗаполняетсяНаМК = Истина;	
		КС = Новый КвалификаторыСтроки(1000);		
		Объект.ТипЗначения = Новый ОписаниеТипов("Строка", , КС);
	КонецЕсли;
	
	ДоступностьЭлементовФормы();	
	
КонецПроцедуры

&НаСервере
Процедура ГруппаРеквизитовПриИзмененииНаСервере()
	
	Если Объект.ГруппаРеквизитов Тогда
		Объект.ЗаполняетсяНаМК = Ложь;
		Объект.Обязателен = Ложь;
		Объект.ОсобыйВидДополнительногоРеквизита = Перечисления.атл_ОсобыеВидыДополнительныхРеквизитов.ПустаяСсылка();
		Объект.ТипЗначения = Неопределено;
	Иначе
		Объект.СворачиватьГруппуРеквизитовПоУмолчанию = Ложь;
	КонецЕсли;
	
	ДоступностьЭлементовФормы();

КонецПроцедуры

#КонецОбласти

