
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОтобразитьПользователейНаКарте();
		
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПользователейНаКарте()
	
	АдресХранилища = ПолучитьТаблицуДляОтображенияТочекНаКарте();
	
	Если ЗначениеЗаполнено(АдресХранилища) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("АдресТаблицы", АдресХранилища);
			
		ОткрытьФорму("Обработка.атл_ОтображениеТочекНаКарте.Форма.ФормаОтображениеСтраницы", ПараметрыФормы);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПользователейМК()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	атл_НастройкиПодключенияМобильныхСотрудников.Пользователь КАК Пользователь,
	               	|	атл_НастройкиПодключенияМобильныхСотрудников.ЯвляетсяПользователемМК КАК ЯвляетсяПользователемМК
	               	|ИЗ
	               	|	РегистрСведений.атл_НастройкиПодключенияМобильныхСотрудников КАК атл_НастройкиПодключенияМобильныхСотрудников
	               	|ГДЕ
	               	|	атл_НастройкиПодключенияМобильныхСотрудников.ЯвляетсяПользователемМК = ИСТИНА";
	Выгрузка = Запрос.Выполнить().Выгрузить();
	мСписок = Выгрузка.ВыгрузитьКолонку("Пользователь");
		
	Возврат мСписок;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуДляОтображенияТочекНаКарте()
	
	СписокПользователейДляПоискаКоординат = ПолучитьСписокПользователейМК();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПРЕДСТАВЛЕНИЕ(атл_АктивностьПользователей.Пользователь) КАК Заголовок,
	               |	атл_АктивностьПользователей.ДатаПоследнейАктивности КАК Время,
	               |	атл_АктивностьПользователей.ДатаПоследнейАктивностиСКоординатами,
	               |	атл_АктивностьПользователей.Широта,
	               |	атл_АктивностьПользователей.Долгота,
	               |	ВЫБОР
	               |		КОГДА атл_АктивностьПользователей.ДатаПоследнейАктивности >= &ДатаДопустимойПоследнейАктивности
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПользовательАктивенМК,
	               |	ВЫБОР
	               |		КОГДА атл_АктивностьПользователей.ДатаПоследнейАктивности = атл_АктивностьПользователей.ДатаПоследнейАктивностиСКоординатами
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПоследняяКоординатаАктуальна,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(256)) КАК Текст,
	               |	ВЫРАЗИТЬ("""" КАК СТРОКА(20)) КАК Цвет
	               |ИЗ
	               |	РегистрСведений.атл_АктивностьПользователей КАК атл_АктивностьПользователей
	               |ГДЕ
	               |	атл_АктивностьПользователей.Пользователь В(&СписокПользователейДляПоискаКоординат)
	               |	И атл_АктивностьПользователей.МК = ИСТИНА";
	
	Запрос.УстановитьПараметр("СписокПользователейДляПоискаКоординат", СписокПользователейДляПоискаКоординат);
	Запрос.УстановитьПараметр("ДатаДопустимойПоследнейАктивности", ТекущаяДата() - ?(Константы.атл_ВремяВТечениеКоторогоПользовательОнлайн.Получить() = 0, 300, Константы.атл_ВремяВТечениеКоторогоПользовательОнлайн.Получить()));
	
	Выгрузка = Запрос.Выполнить().Выгрузить();
	
	Если Выгрузка.Количество() > 0 Тогда		
		
		Для Каждого текСтрока Из Выгрузка Цикл
			
			Если СокрЛП(текСтрока.Широта) = "" или СокрЛП(текСтрока.Широта) = "0"
						или СокрЛП(текСтрока.Долгота) = "" или СокрЛП(текСтрока.Долгота) = "0" Тогда
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Координаты последней активности пользователя '" + текСтрока.Заголовок + "' указаны неверно. Пользователь пропущен!";
				Сообщение.Сообщить();				
				Выгрузка.Удалить(текСтрока);
				Продолжить;
			КонецЕсли;
						
			Если текСтрока.ПоследняяКоординатаАктуальна Тогда
				текСтрока.Текст = "";
				Если текСтрока.ПользовательАктивенМК  Тогда
					текСтрока.Цвет = "green";
				Иначе
					текСтрока.Цвет = "red";
				КонецЕсли;
			Иначе
				текСтрока.Текст = "Координата получена " + текСтрока.ДатаПоследнейАктивностиСКоординатами;
				текСтрока.Цвет = "grey";
			КонецЕсли;
		КонецЦикла;
				
		Если Выгрузка.Количество() > 0 Тогда
			//ОбработкаОтображения.Открыть();
			АдресХранилища = ПоместитьВоВременноеХранилище(Выгрузка);
			Возврат АдресХранилища;
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Нет информации для отражения на карте!";
			Сообщение.Сообщить();			
		КонецЕсли;

	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет информации для отражения на карте!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Возврат "";	
	
КонецФункции


