
&НаКлиенте
Процедура ДопустимыеСимволы(Команда)

	атл_УправлениеМобильнымиСотрудниками.ПоказатьСписокДопустимыхСимволовКлючаШифрования();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РезультатПроверкиКлюча = ПроверитьКлючШифрования(СокрЛП(Объект.Наименование));
	Если Не РезультатПроверкиКлюча Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ключ шифрования указан неверно! Запись невозможна!";
		Сообщение.Сообщить();
		
		атл_УправлениеМобильнымиСотрудниками.ПоказатьСписокДопустимыхСимволовКлючаШифрования();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКлючШифрования(КлючШифрования) Экспорт
	
	КлючШифрованияПравильный = Ложь;
	
	Если СтрДлина(КлючШифрования) < 10 Тогда
		РезультатПроверкиКлюча = 2;
		КлючШифрованияПравильный = Ложь;
		ТекстСообщения = "Ключ """+КлючШифрования+""" имеет длину менее 10 символов! Ошибка ключа шифрования!";
	ИначеЕсли атл_УправлениеМобильнымиСотрудниками.ЕстьОшибкиВКлючеШифрования(СокрЛП(КлючШифрования)) Тогда
		РезультатПроверкиКлюча = 1;
		КлючШифрованияПравильный = Ложь;
		ТекстСообщения = "Ключ """+КлючШифрования+""" содержит недопустимые символы. Ошибка ключа шифрования!";
	Иначе
		РезультатПроверкиКлюча = 0;
		ТекстСообщения = "";
		КлючШифрованияПравильный = Истина;
	КонецЕсли;
	Если Не ТекстСообщения = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "" + ТекстСообщения;
		Сообщение.Сообщить();		
	КонецЕсли;
	
	Возврат КлючШифрованияПравильный;
	
КонецФункции
