
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Запись.КомментарийСВложением Тогда
		//необходимо открыть файл - вложение						
		ИмяФайла = "";
		АдресФайла = "";
		
		ПолучитьИмяФайлаИАдрес(ИмяФайла, АдресФайла);			
		
		#Если ВебКлиент Тогда
			
			Если Не ПодключитьРасширениеРаботыСФайлами() Тогда 
	            ПодключитьРасширениеРаботыСФайлами();								
			КонецЕсли;
			ПолучитьФайл(АдресФайла, ИмяФайла, Истина);
		
		#Иначе
			
			РабочийКаталогПользователя = КаталогВременныхФайлов();
			ПолноеИмяФайлаНаКлиенте = РабочийКаталогПользователя + ИмяФайла;		
					
			Попытка
				ФайлНаДиске = Новый Файл(ПолноеИмяФайлаНаКлиенте);				
				Если ФайлНаДиске.Существует() Тогда
					ЗапуститьПриложение(ПолноеИмяФайлаНаКлиенте);
				Иначе
					ПолучитьФайл(АдресФайла, ПолноеИмяФайлаНаКлиенте, Ложь);
					ЗапуститьПриложение(ПолноеИмяФайлаНаКлиенте);
				КонецЕсли;
			Исключение
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Не удалось для открытия записать файл на диск!";
				Сообщение.Сообщить();				
			КонецПопытки;
			
		#КонецЕсли
				
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьИмяФайлаИАдрес(ИмяФайла, АдресФайла)
	
	ЗаписьФайла = РегистрыСведений.атл_ФайлыУМС.СоздатьМенеджерЗаписи();
	ЗаписьФайла.ИдентификаторИнформационнойБазы = Запись.ИдентификаторИнформационнойБазыФайла;
	ЗаписьФайла.ИдентификаторФайла = Запись.ИдентификаторФайла;
	ЗаписьФайла.Прочитать();
	
	ИмяФайла = ЗаписьФайла.ИмяФайла;
	ДвоичныеДанные = ЗаписьФайла.ДанныеФайла.Получить();
	АдресФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	
КонецПроцедуры



