
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДеньНачала = Параметры.ДеньНачала;
	ГрафикОбслуживания = Параметры.ГрафикОбслуживания;
	
	ВремяРаботыИзГрафикаОбслуживания = 1;
	ДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ДоступностьЭлементовФормы()
	
	мДоступность = ?(ВремяРаботыИзГрафикаОбслуживания = 0, Истина, Ложь);
	
	Элементы.ВремяС.Доступность = мДоступность;
	Элементы.ВремяПо.Доступность = мДоступность;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяРаботыИзГрафикаОбслуживанияПриИзменении(Элемент)
	
	ДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполнения()	
	
	флагПроверки = Истина;
	
	Если ДеньНачала <= 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите день месяца";
		Сообщение.Поле = "ДеньНачала";
		Сообщение.Сообщить();		
		флагПроверки = Ложь;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ГрафикОбслуживания) И ВремяРаботыИзГрафикаОбслуживания = 1 Тогда
		Если ЗначениеЗаполнено(ПолучитьЗначениеКонстантыОсновнойГрафикОбслуживания()) Тогда
			флагПроверки = Ложь;
			мОповещение = Новый ОписаниеОповещения("ПроверкаЗаполненияЗавершение", ЭтотОбъект);
			ПоказатьВопрос(мОповещение, "У сотрудника не указан ""Основной график работы"".
							|График будет заполнен по основному график обслуживания компании. Продолжить?", РежимДиалогаВопрос.ДаНет);			
			
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "У сотрудника и у компании не указан ""Основной график работы"".
								|Поэтому нельзя выбрать вариант ""Время работы из графика обслуживания"". ";
			Сообщение.Сообщить();
			
			ВремяРаботыИзГрафикаОбслуживания = Ложь;
			ДоступностьЭлементовФормы();
			флагПроверки = Ложь;			
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьГрафикРаботыЗавершение();
		
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = КодВозвратаДиалога.Нет ИЛИ ДеньНачала <= 0 Тогда
		флагПроверки = Ложь;
	Иначе
		флагПроверки = Истина;
	КонецЕсли;		
	
	ЗаполнитьГрафикРаботыЗавершение();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикРаботы(Команда)
	
	ПроверкаЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафикРаботыЗавершение()
		
	Если флагПроверки Тогда
		мСтруктура = Новый Структура;
		мСтруктура.Вставить("ДеньНачала", ДеньНачала);
		мСтруктура.Вставить("КоличествоРабочихДней", КоличествоРабочихДней);
		мСтруктура.Вставить("КоличествоВыходных", КоличествоВыходных);
		мСтруктура.Вставить("ВремяС", ВремяС);
		мСтруктура.Вставить("ВремяПо", ВремяПо);
		мСтруктура.Вставить("ВремяРаботыИзГрафикаОбслуживания", ?(ВремяРаботыИзГрафикаОбслуживания = 1, Истина, Ложь));
		
		Закрыть(мСтруктура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначениеКонстантыОсновнойГрафикОбслуживания()
	
	Возврат Константы.атл_ОсновнойГрафикОбслуживания.Получить();
	
КонецФункции


