
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаШапки = Параметры.СтрокаШапки;
	СтрокаВерсии = Параметры.СтрокаВерсии;
	ТекстВсехСообщений = Параметры.ТекстВсехСообщений;
	
	Если ЗначениеЗаполнено(СтрокаШапки) ИЛИ ЗначениеЗаполнено(СтрокаВерсии) Тогда
		ВывестиОписаниеОбновленийДляЗаданнойВерсии();
	КонецЕсли;
	
КонецПроцедуры


#Область ОбработчикиЭлементовФормы

&НаКлиенте
Процедура ВывестиОписаниеОбновлений(Команда)
	
	ВывестиОписаниеОбновленийНаСервере();		
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОписаниеОбновленийВыбор(Элемент, Область, СтандартнаяОбработка)
	
	Если Найти(Область.Текст, "http://") = 1 Или Найти(Область.Текст, "https://") = 1 Тогда
		ПерейтиПоНавигационнойСсылке(Область.Текст);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОписаниеОбновленийОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Форма") Тогда
		// В расшифровке может содержаться какая-либо форма.
		СтандартнаяОбработка = Ложь;
		Расшифровка.Открыть();
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Строка") Тогда
		// В расшифровке может содержаться вызов функции встроенного языка
		Если Найти(Расшифровка, "()") Тогда
			Выполнить(Расшифровка);
		КонецЕсли;
		// В расшифровке может содержаться URL
		СтандартнаяОбработка = Ложь;
		ЗапуститьПриложение(Расшифровка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНаСервере();
	
КонецПроцедуры

	
#КонецОбласти


#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ВывестиОписаниеОбновленийНаСервере()
	
	ДокументОписаниеОбновлений = Обработки.атл_ОбновлениеИнформационнойБазы.ПолучитьМакет("ОписаниеОбновлений");	
	
КонецПроцедуры

&НаСервере
Процедура ВывестиОписаниеОбновленийДляЗаданнойВерсии()
	
	МакетОписаниеОбновлений = Обработки.атл_ОбновлениеИнформационнойБазы.ПолучитьМакет("ОписаниеОбновлений");	
	
	ДокументОписаниеОбновлений.Очистить();
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть(СтрокаШапки));
	ДокументОписаниеОбновлений.НачатьГруппуСтрок(СтрокаВерсии);
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть(СтрокаВерсии));
	ДокументОписаниеОбновлений.ЗакончитьГруппуСтрок();
	ДокументОписаниеОбновлений.Вывести(МакетОписаниеОбновлений.ПолучитьОбласть("Отступ"));
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	мПараметры = Новый Структура;
	мПараметры.Вставить("ПараметрыВерсии", Неопределено);
	мПараметры.Вставить("ОткрытьФормуОписанияОбновлений", Ложь);
	мПараметры.Вставить("ТекстВсехСообщений", "");
	
	ТекстВсехСообщений =  "";
		
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	ЭтаОбработка.ВыполнитьОбновление(мПараметры);
	
	Если ТипЗнч(мПараметры.ПараметрыВерсии) = Тип("Структура") Тогда
		мПараметры.ПараметрыВерсии.Свойство("ТекстВсехСообщений", ТекстВсехСообщений);
		Если мПараметры.ОткрытьФормуОписанияОбновлений Тогда
			мПараметры.ПараметрыВерсии.Свойство("СтрокаВерсии", СтрокаВерсии);		
			мПараметры.ПараметрыВерсии.Свойство("СтрокаШапки", СтрокаШапки);
		КонецЕсли;
		
		ВывестиОписаниеОбновленийДляЗаданнойВерсии();
	КонецЕсли;
	
КонецПроцедуры


	
#КонецОбласти


