
Перем мПереченьИнтерваловДляРасчета;

Процедура ПриЗаписи(Отказ)
	
	//производим расчет времени по интервалам
	
	Если мПереченьИнтерваловДляРасчета.Количество() > 0 Тогда
		//обходим интервалы и производим пересчет
		Для Каждого Интервал Из мПереченьИнтерваловДляРасчета Цикл
			 атл_УправлениеМобильнымиСотрудниками.СформироватьЗаписьВРегистреатл_ЗатраченноеВремяПоИнтерваламПоЗадачамМобильнымСотрудникам(Ссылка, Интервал);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//определяем, какие интервалы необходимо рассчитать
	мПереченьИнтерваловДляРасчета = Новый Массив;
	
	МассивИнтервалов = атл_УправлениеМобильнымиСотрудниками.ПолучитьМассивИнтервалов();
	
	Если ЭтоНовый() Тогда
		//записываем все интервалы
		Для Каждого Интервал из МассивИнтервалов Цикл
			мПереченьИнтерваловДляРасчета.Добавить(Интервал);
		КонецЦикла;
	Иначе
		Для Каждого Интервал из МассивИнтервалов Цикл
			Если ЭтотОбъект[Интервал.ИмяРеквизитаДатаНачала] <> Ссылка[Интервал.ИмяРеквизитаДатаНачала] или
				ЭтотОбъект[Интервал.ИмяРеквизитаДатаОкончания] <> Ссылка[Интервал.ИмяРеквизитаДатаОкончания] Тогда
				мПереченьИнтерваловДляРасчета.Добавить(Интервал.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
