
Процедура Печать(Таб, МассивИменФайлов) Экспорт
		
	Макет = РегистрыСведений.атл_СтатистикаОбменовДаннымиССерверомУМС.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Строка");
	             
	Ном = 0;
	Для Каждого Стр из МассивИменФайлов Цикл
		ПолноеИмяФайла = КаталогВременныхФайлов() + Стр;
		Файл = Новый Файл(ПолноеИмяФайла);
		Если Файл.Существует() Тогда
			Ном = Ном + 1;
			Область.Параметры.Ном 				= Ном;
			Область.Параметры.ИмяФайла 			= Стр;
			Область.Параметры.ДатаФайла 		= Файл.ПолучитьВремяИзменения();
			
			Объект = Новый ЧтениеТекста(ПолноеИмяФайла);
	        Область.Параметры.СодержимоеФайла = Объект.Прочитать();
			
			Таб.Вывести(Область);
		Иначе
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось найти файл " + Файл;				
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры