
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НаименованиеТекущегоОтчета = Параметры.НаименованиеОтчета;
	мТаблица = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыРасшифровок);
	ТаблицаРасшифровок.Загрузить(мТаблица);
	
	ЗаполнитьДеревоРасшифровок();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоРасшифровок()
	
	ДеревоРасшифровок.ПолучитьЭлементы().Очистить();
	
	ВерхняяКоллекцияДерева = ДеревоРасшифровок.ПолучитьЭлементы();
	КоллекцияДерева = ДеревоРасшифровок.ПолучитьЭлементы();
	мПустойЦвет = Новый Цвет(0,0,0);
	
	мОтбор = Новый Структура;
	мОтбор.Вставить("НаименованиеОтчета", Параметры.НаименованиеОтчета);
	мНайденныеСтроки = ТаблицаРасшифровок.НайтиСтроки(мОтбор);
	
	Для Каждого текСтрока Из мНайденныеСтроки Цикл
		Если текСтрока.ГруппировкаСтрок Тогда
			мНоваяСтрока = ВерхняяКоллекцияДерева.Добавить();
			мНоваяСтрока.Показатель = текСтрока.Показатель;
			мНоваяСтрока.ЗначениеПоказателя = текСтрока.ЗначениеПоказателя;			
			мНоваяСтрока.ИдентификаторПоказателя = текСтрока.ИдентификаторПоказателя;
			мНоваяСтрока.КлючСтроки = текСтрока.КлючСтроки;
			КоллекцияДерева = мНоваяСтрока.ПолучитьЭлементы();
			
			//Условное оформление. Раскраска строк
			Если НЕ текСтрока.Цвет = мПустойЦвет Тогда				
				Элемент = УсловноеОформление.Элементы.Добавить();

				ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРасшифровок.Имя);

				ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРасшифровок.Показатель");
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = текСтрока.Показатель;
				
				Если текСтрока.КлючСтроки > 0 Тогда
					ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРасшифровок.КлючСтроки");
					ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ОтборЭлемента.ПравоеЗначение = текСтрока.КлючСтроки;
				КонецЕсли;

				Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", текСтрока.Цвет);	
			КонецЕсли;
		Иначе
			мНоваяСтрока = КоллекцияДерева.Добавить();
			мНоваяСтрока.Показатель = текСтрока.Показатель;
			мНоваяСтрока.ЗначениеПоказателя = текСтрока.ЗначениеПоказателя;			
			мНоваяСтрока.ИдентификаторПоказателя = текСтрока.ИдентификаторПоказателя;
			мНоваяСтрока.КлючСтроки = текСтрока.КлючСтроки;
			
			//Условное оформление. Раскраска строк
			Если НЕ текСтрока.Цвет = мПустойЦвет Тогда
				Элемент = УсловноеОформление.Элементы.Добавить();

				ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
				ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРасшифровок.Имя);

				ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРасшифровок.Показатель");
				ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
				ОтборЭлемента.ПравоеЗначение = текСтрока.Показатель;
				
				Если текСтрока.КлючСтроки > 0 Тогда
					ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРасшифровок.КлючСтроки");
					ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ОтборЭлемента.ПравоеЗначение = текСтрока.КлючСтроки;
				КонецЕсли;

				Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", текСтрока.Цвет);
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРасшифровокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	мТекущаяСтрока = ДеревоРасшифровок.НайтиПоИдентификатору(ВыбраннаяСтрока);
	Если НЕ мТекущаяСтрока = Неопределено Тогда
		ВладелецФормы.ОбработатьРезультатВыбораРасшифровкиОтчета(мТекущаяСтрока.ИдентификаторПоказателя, мТекущаяСтрока.КлючСтроки, НаименованиеТекущегоОтчета);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры



