
Процедура ВыполнитьРассчетКоличестваМинут(ТекущиеДанные) Экспорт
	РазностьДат = 0;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РАЗНОСТЬДАТ(&ДатаНачала, &ДатаОкончания, МИНУТА) КАК РазностьДат";
	Запрос.УстановитьПараметр("ДатаНачала", 	ТекущиеДанные.ВремяС);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ТекущиеДанные.ВремяПо);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РазностьДат = Выборка.РазностьДат;
	КонецЕсли;
	ТекущиеДанные.Количество = РазностьДат;
КонецПроцедуры