// Модуль отсутствует в ПРОФ версии.
// Изменения запрещены, текст модуля не включается.

#Область ПроцедурыИФункции

// Получает защищенную обработку Базовой версии.
//
Функция ПолучитьЗащищеннуюОбработку() Экспорт
	
	ЗащищенныйОбъект = Неопределено;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Защита = Неопределено;
	Попытка
		Защита = Новый("ОписаниеЗащитыОтОпасныхДействий");
		Защита.ПредупреждатьОбОпасныхДействиях = Ложь;
	Исключение
		// Исключение возможно на предыдущих версиях платформы без механизма защиты от опасных действий.
	КонецПопытки;
	
	ДвоичныеДанные = ПолучитьОбщийМакет("СЗК_ДополнительныеПараметрыБазовая");
	
	Попытка
		
		Если Защита = Неопределено Тогда
			ЗащищенныйОбъект = ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(ПоместитьВоВременноеХранилище(ДвоичныеДанные), , БезопасныйРежим()));
		Иначе
			ЗащищенныйОбъект = ВнешниеОбработки.Создать(ВнешниеОбработки.Подключить(ПоместитьВоВременноеХранилище(ДвоичныеДанные), , БезопасныйРежим(), Защита));
		КонецЕсли;
		
	Исключение
		
		УстановитьПривилегированныйРежим(Ложь);
		ВызватьИсключение(ОписаниеОшибки());
		
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЗащищенныйОбъект;
	
КонецФункции // ПолучитьЗащищеннуюОбработку()

#КонецОбласти
